JAVAコンテンツ【基礎編】 第11章 確認問題

1. クラスのメンバーは、何と何ですか？

フィールド(クラス変数)、クラスメソッド

2. アクセス修飾子は、何種類ありますか？

4種類

デフォルトアクセス、パッケージアクセス(現在のクラスと同じパッケージのクラスからアクセス可能)
public(すべてのクラスからアクセス可能)
protected(現在のクラスとサブクラスからアクセス可能)
private(現在のクラスからのみアクセス可能)

3. アクセス修飾子で、クラスに定義できるのは何と何ですか？

publicとパッケージアクセス

4. インスタンス生成時に呼び出されるメソッドを何と呼びますか？

コンストラクタ

#カリキュラム第9章、ClassMethod01.java

5. ディレクトリ階層でクラスをグループ化するしくみを何と呼びますか？

パッケージ

#カリキュラム第9章、パッケージの項

6. クラスで定義された変数を何変数と呼びますか？

メンバー変数

#カリキュラム第9章、Human01.java

7. メソッド内で定義された変数を何変数と呼びますか？

ローカル変数

#カリキュラム第9章、「インスタンス変数とローカル変数」

8. クラスから直接呼び出しができるメソッドを何と呼びますか？

staticメソッド、クラスメソッド

#カリキュラム第9章、ClassMethod04.java

9. チェックする必要がない例外を何と呼びますか？

RuntimeExceptionクラス
(実行時例外、非検査例外)
予見できない、Javaのシステムに任せるしかないエラー

#カリキュラム第10章

10. オブジェクト指向は、プログラムを何に見立ててプログラミングしますか？

現実世界の「もの」

#カリキュラム第11章

11. Javaで「型」というと、何を指しますか？

クラス

12. クラスを実体化したものを何と呼びますか？

インスタンス

#カリキュラム第11章

13. インスタンスを生成することを何と呼びますか？

インスタンス化
